# 1)მომხმარებელს შემოატანინეთ მისი ასაკი და გაიგეთ რამდენჯერ მოთავსდება რიცხვი 10 მასში

# 2)მომხმარებელს შემოატანინეთ მისი სახელი და გაიგეთ უდრის თუ არა ის თქვენს სახელს

# 3)მომხმარებელს შემოატანინეთ ორი რიცხვი (num1 და num2) და გაიგეთ რა იქნება ნაშთი,
# პირველი რიცხვის მეორეზე გაყოფის შემდეგ

# 4)მომხმარებელს შემოატანინეთ მისი ასაკი და გაიგეთ არის თუ არა ის ლუწი
# (იყოფა თუ არა ზუსტად 2ზე) ანუ გვრჩება თუ არა ნაშთი ნული, ორზე გაყოფის შედეგად

# 5) აუცილებლად უყურეთ ჩანაწერს


age = int(input("enter your age"))
print(age // 10)

myname = "nikachitadze"
username= input("enter your name")
if myname == username:
    print("ჩვენი სახელები ემთხვევა ერთმანეთს")
else:
    print("ჩვენი სახელები განსხვავდება")