# 1)შექმენით ცვლადი შეინახეთ მნიშვნელობად რაიმე სტრინგი
# შენი დავალებაა შეამოწმო,თუ ცვლადში შენახული სტრინგის პირველი ასო არის დიდი,
# მაგ შემთხვევაში დაუპრინტე ეს სიტყვა uppercase ში,სხვა შემთხვევაში კი დაუპრინტე ეს სიტყვა lowercase ში

# 2)მომხმარებელს შემოატანინე სახელი,თუ მომხმარებლის შემოტანილი სახელი შეიცავს ერთ uppercase ასოს მაინც
# (for loop გამოიყენეთ)მაშინ დაპრინტე ეს სახელი მთლიანად lowercase ში,სხვა შემთხვევაში დაპრინტე ეს სახელი
# რომელიც იქნება capitalize 

# 3)შექმენით სია სადაც მოათავსებული გექნებათ ცხვოველის სახელები,შენი დავალებაა შეამოწმო,თუ სიაში მყოფი
# სახელებიდან რომელიმე სიგრძე ნაკლებია 5 ზე და თან ეს სიტყვა არის capitalized დააბრუნე ამ სიტყვიდან პირველი
#  3 ასო,
# სხვა შემთხვევაში დაუპრინტე რომ ეს სიტყვა გრძელია

# 4)შექმენი სია სადაც გექნება მოთავსებული lowercase სახელები,
# შენი დავალებაა გადაიყვანო და გამოპრინტო ყველა მათგანი uppercase ში

# 5)შექმენი სია სადაც გადაცემული გექნებათ სხვადასხვა მონაცემთა ტიპები,
# შენი დავალებაა შეამოწმო,თუ სიაში იმყოფება სტრინგ ტიპის მონაცემი,ეს სტრინგი უნდა გადააქციო uppercase 
# ად და უნდა დააბრუნოთ ამ სტრინგიდან ბოლო 3 ასო გამოიყენეთ მინუს ინდექსები

name = "Nika"
if name[0].isupper():
    print(name.upper())   
else:
    print(name.lower()) 



name=input("enter your name:")

for i in name:
    if i.isupper():
        print(name.lower())

else:
    print(name.capitalize())


list=["nikolozi", "luka", "giorgi", ]

if type (list)==str:
    print[-3:]


for i in list:
    print(i.upper())

    
    

list=["nikolozi", "goa", "hello", "world"]

for i in list:
    print(i.upper())


list=["dog", "cat", "lion", "tiger" , "snake"]

for i in list:
    if len(list) <5:
        print(-1)

else:
    print("this word is long")

