# <!-- 1)შექმენით ახალი სია, რომელიც შეიცავს 1-დან 10-მდე რიცხვების კვადრატებს.
# 2) მოცემული სიიდან [1, 2, 3, 4, 5, 6, 7, 8, 9, 10] შეარჩიეთ მხოლოდ ლუწი რიცხვები.
# 3)მოცემული სტრიქონების სიიდან ["apple", "banana", "cherry", "date"] შექმენით
#  ახალი სია, სადაც ყველა სიტყვა დიდი ასოებით იქნება დაწერილი.
# 4)მოცემული სიიდან ["cat", "dog", "elephant", "mouse"] შექმენით ახალი სია,
#  რომელიც შეიცავს თითოეული სიტყვის სიგრძეს.
# 5)მოცემული სიიდან [5, 12, 8, 20, 3, 15] შექმენით ახალი სია, რომელიც შეიცავს 
# მხოლოდ 10-ზე მეტ რიცხვებს.
# 6)მოცემული სიის [1, 2, 3, 4] თითოეული ელემენტი გაამრავლეთ 5-ზე.
# 7)მოცემული სიიდან ["hello", "world", "python", "programming", "list"] 
# აირჩიეთ მხოლოდ ის სიტყვები, რომლებიც იწყება ასო 'p'-ით.
# 8)1-დან 10-მდე რიცხვებისთვის შექმენით სია, სადაც ლუწი რიცხვებისთვის ჩაიწერება
#  'Even', ხოლო კენტი რიცხვებისთვის 'Odd'.
# 9)აუცილებლად გადახედეთ ჩანაწერს და დაიწყეთ ჯგუფურ სამუშაოზეც მუშაობა -->



numbers = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
even = [i for i in numbers if i % 2 == 0]
print(even)

list = ["apple", "banana", "cherry", "date"]
new_list = [list.upper() for list in list]
print(new_list)

add = [5, 12, 8, 20, 3, 15]
new_add = [i for i in add if i>10]
print(new_add)


ioi = [1, 2, 3, 4]
new_ioi = [i * 5 for i in ioi]
print(new_ioi)


word = ["hello", "world", "python", "programming", "list"]
p = [i for i in word if i.startswith('p')]
print(p)
# startswith ვამოწმებთ რაიმე სიტვა იწყება თუ არა მაგალითად ნ ზე


